StateMachine.mmd
stateDiagram-v2
  %% direction LR

  state PREP_CORAL_GROUP {
      PREP_CORAL_L1
      PREP_CORAL_L2
      PREP_CORAL_L3
      PREP_CORAL_L4
      PREP_CORAL_ZERO
  }
  state PREP_CORAL_WITH_ALGAE_GROUP {
      PREP_CORAL_WITH_ALGAE_L1
      PREP_CORAL_WITH_ALGAE_L2
      PREP_CORAL_WITH_ALGAE_L3
      PREP_CORAL_WITH_ALGAE_L4
      PREP_CORAL_ZERO_WITH_ALGAE
  }
  state PREP_ALGAE_GROUP {
      PREP_ALGAE_NET
      PREP_ALGAE_PROCESSOR
      PREP_ALGAE_ZERO
  }
  state PREP_ALGAE_WITH_CORAL_GROUP {
      PREP_ALGAE_NET_WITH_CORAL
      PREP_ALGAE_PROCESSOR_WITH_CORAL
      PREP_ALGAE_ZERO_WITH_CORAL
  }

  state INTAKE_CORAL_GROUP {
      INTAKE_CORAL_GROUND
      INTAKE_CORAL_STATION
  }

  state INTAKE_ALGAE_GROUP {
      INTAKE_ALGAE_GROUND
      CLEAN_HIGH
      CLEAN_LOW
  }

  state INTAKE_CORAL_WITH_ALGAE_GROUP {
      INTAKE_CORAL_WITH_ALGAE_GROUND
      INTAKE_CORAL_WITH_ALGAE_STATION
  }
  
  state INTAKE_ALGAE_WITH_CORAL_GROUP {
      INTAKE_ALGAE_WITH_CORAL_GROUND
      CLEAN_HIGH_WITH_CORAL
      CLEAN_LOW_WITH_CORAL
  }
  EJECTING
  HAS_CORAL
  HAS_ALGAE
  HAS_CORAL_AND_ALGAE
  SCORING_CORAL
  SCORING_CORAL_WITH_ALGAE
  SCORING_ALGAE
  SCORING_ALGAE_WITH_CORAL
  PREP_CLIMB
  CLIMBING
 
  %% [*] - REPRESENTS NONE (starting and end)
  [*] --> INTAKE_CORAL_GROUP
  [*] --> INTAKE_ALGAE_GROUP
  [*] --> PREP_CLIMB
  %% INTAKING
  INTAKE_ALGAE_GROUP --> [*]
  INTAKE_CORAL_GROUP --> [*]
  INTAKE_CORAL_GROUP --> HAS_CORAL
  INTAKE_ALGAE_GROUP --> HAS_ALGAE
  INTAKE_CORAL_WITH_ALGAE_GROUP --> HAS_CORAL_AND_ALGAE
  INTAKE_ALGAE_WITH_CORAL_GROUP --> HAS_CORAL_AND_ALGAE
  %% HAS SCORING ELEMENT
  HAS_CORAL --> PREP_CORAL_GROUP
  HAS_CORAL --> INTAKE_ALGAE_WITH_CORAL_GROUP
  HAS_CORAL --> PREP_CLIMB
  HAS_CORAL --> EJECTING
  HAS_ALGAE --> INTAKE_CORAL_WITH_ALGAE_GROUP
  HAS_ALGAE --> PREP_ALGAE_GROUP
  HAS_ALGAE --> PREP_CLIMB
  HAS_ALGAE --> EJECTING
  HAS_CORAL_AND_ALGAE --> PREP_CORAL_WITH_ALGAE_GROUP
  HAS_CORAL_AND_ALGAE --> PREP_ALGAE_WITH_CORAL_GROUP
  HAS_CORAL_AND_ALGAE --> PREP_CLIMB
  HAS_CORAL_AND_ALGAE --> EJECTING

  %% PREPPING
  PREP_CORAL_GROUP --> SCORING_CORAL
  PREP_CORAL_WITH_ALGAE_GROUP --> SCORING_CORAL_WITH_ALGAE
  PREP_ALGAE_GROUP --> SCORING_ALGAE
  PREP_ALGAE_WITH_CORAL_GROUP --> SCORING_ALGAE_WITH_CORAL
  PREP_ALGAE_WITH_CORAL_GROUP --> PREP_CORAL_WITH_ALGAE_GROUP
  PREP_CORAL_WITH_ALGAE_GROUP --> PREP_ALGAE_WITH_CORAL_GROUP
  PREP_ALGAE_GROUP --> EJECTING
  PREP_CORAL_GROUP --> EJECTING
  PREP_CORAL_WITH_ALGAE_GROUP --> EJECTING
  PREP_ALGAE_WITH_CORAL_GROUP --> EJECTING
  %% CLIMBING
  PREP_CLIMB --> CLIMBING
  PREP_CLIMB --> [*]
  %% SCORING
  SCORING_CORAL --> [*]
  SCORING_ALGAE --> [*]
  SCORING_CORAL_WITH_ALGAE --> HAS_ALGAE
  SCORING_ALGAE_WITH_CORAL --> HAS_CORAL
  EJECTING --> [*]

  
